# CannotCutRoof Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..CutFailures..::..CannotCutRoof Property
BuiltInFailures..::..CutFailures Class See Also
---
The roof couldn't be cut.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotCutRoof { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotCutRoof As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotCutRoof {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..CutFailures Class
Autodesk.Revit.DB Namespace